Ruby on Rails/blog/app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["body", "balabalababa"], ["updated_at", "2021-10-05 06:07:01.861739"], ["status", "public"], ["id", 3]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)