Ruby on Rails/blog/app/controllers/comments_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("commenter", "body", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "hoffman"], ["body", "Cool~~~~"], ["article_id", 1], ["created_at", "2021-10-05 04:32:24.008807"], ["updated_at", "2021-10-05 04:32:24.008807"]]
---
    def create
        @article = Article.find(params[:article_id])
        # ---> `@article.comments` will automatically link the comment
        # so that if belongs to that particular article
        @comment = @article.comments.create(comment_params)