Ruby on Rails/blog/app/controllers/microposts_controller.rb

SELECT "microposts".* FROM "microposts"
---
  def index
    @microposts = Micropost.all

INSERT INTO "microposts" ("context", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["context", "my first microposts"], ["user_id", 1], ["created_at", "2021-10-01 00:36:11.675073"], ["updated_at", "2021-10-01 00:36:11.675073"]]
---
  def create
    @micropost = Micropost.new(micropost_params)

    respond_to do |format|
      if @micropost.save

UPDATE "microposts" SET "context" = ?, "updated_at" = ? WHERE "microposts"."id" = ?  [["context", "first222"], ["updated_at", "2021-10-03 03:41:14.399454"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @micropost.update(micropost_params)